import streamlit as st

st.set_page_config(
    page_title="project",
    page_icon="📖",
)

st.markdown(
    """
    ## Проект создания Группы Автоматизации 
    в составе Отдела Инновационных Технологий Проектно Конструкторской Группы АО “КОНЦЕРН ТИТАН-2”

    Ресурс разработан в рамках инициативных работ по созданию
    Группы автоматизации

    ## Состав группы:
        - Захаров Сергей Владимирович
        - Алексеев Юрий Васильевич

    ## Цель группы:
        Автоматизация процессов Отдела Инновационных Технологий

    ## Задачи группы:
        ### Захаров Сергей Владимирович:
        - разработка и поддержка цифровой базы данных 
            разработанных исполнений элементов ОПС КТ2;
        - разработка, актуализация и внедрение цифрового 
            документооборота на базе Google Docs - Каталог ОПС КТ2,
            Ведомость отправочных марок, Ведомость материалов / 
            Ведомость покупных изделий;
        - разработка, актуализация и совершенствование классификатора ОПС
            согласно кодов AKU, Lisega и KT2 разработанного на базе 
            Python Streamlit;
        -   поддержание текущего и разработка последующих планов разработки ОПС КТ2.





    
    
    ⬅️ Слева расположен сайдбар с выбором вкладок:

    - «Test task» - тестовое задание.
    - «Dataizer workspase» - обрабатка датафреймов из тестового задания.
    - «Plotting Demo» - рандомизированный график.
    - «DataFrame visualizer» - визуализатор датафреймов.
        Для примера взято валовое сельскохозяйственное производство по годам.

    ### Что дальше?
    - Завершение работы над «Dataizer workspase».
    - Добавление автоматического анализа А/В тестов.


    ### Хотите знать немного больше об авторе?
    - Мои работы:
        - [Классификатор для РОСАТОМА](https://classificator.streamlit.app/)
        - [Атесстация в ИТМО](https://itmofinishwork.streamlitapp.com/)
    - Здесь мои социальные сети:
        - [telegram.org](https://t.me/newer0ne)
        - [linkedin.com](https://www.linkedin.com/in/sergey-zakharov-162331223/)
        - [vk.com](https://vk.com/id1237712)
        - [github.com](https://github.com/newer0ne)
    - Контакты на рекрутинговых платформах:
        - [headhunter.ru](https://hh.ru/resume/7e8af31aff09d92df80039ed1f674457646c75)
        - [career.habr.com](https://career.habr.com/sergeyzaharov123)
    - Если возникли какие-то вопросы моя электрнная почта work.sergeyzaharov@gmail.com
"""
)